src/AmazonPaymentBundle/Tests/fixtures/capture/closed.xml

<CaptureResponse xmlns="http://mws.amazonservices.com/schema/OffAmazonPayments/2013-01-01">
    <CaptureResult>
        <CaptureDetails>
            <AmazonCaptureId>P01-1234567-1234567-0000003</AmazonCaptureId>
            <CaptureReferenceId>CAPTURE-REFERENCE-CLOSED-ID</CaptureReferenceId>
            <SellerCaptureNote>Lorem ipsum</SellerCaptureNote>
            <CaptureAmount>
                <CurrencyCode>EUR</CurrencyCode>
                <Amount>94.50</Amount>
            </CaptureAmount>
            <CaptureStatus>
                <State>Closed</State>
                <LastUpdateTimestamp>2012-11-03T19:10:16Z</LastUpdateTimestamp>
                <ReasonCode>MaxAmountRefunded</ReasonCode>
            </CaptureStatus>
            <RefundedAmount>
                <Amount>94.50</Amount>
                <CurrencyCode>EUR</CurrencyCode>
            </RefundedAmount>
            <CreationTimestamp>2012-11-03T19:10:16Z</CreationTimestamp>
        </CaptureDetails>
    </CaptureResult>
    <ResponseMetadata>
        <RequestId>b4ab4bc3-c9ea-44f0-9a3d-67cccef565c6</RequestId>
    </ResponseMetadata>
</CaptureResponse>