src/AmazonPaymentBundle/Tests/fixtures/capture/declined-ProcessingFailure.xml

<CaptureResponse xmlns="http://mws.amazonservices.com/schema/OffAmazonPayments/2013-01-01">
    <CaptureResult>
        <CaptureDetails>
            <AmazonCaptureId>P01-1234567-1234567-0000006</AmazonCaptureId>
            <CaptureReferenceId>CAPTURE-REFERENCE-ID</CaptureReferenceId>
            <SellerCaptureNote>Lorem ipsum</SellerCaptureNote>
            <CaptureAmount>
                <CurrencyCode>EUR</CurrencyCode>
                <Amount>94.50</Amount>
            </CaptureAmount>
            <CaptureStatus>
                <State>Declined</State>
                <LastUpdateTimestamp>2012-11-03T19:10:16Z</LastUpdateTimestamp>
                <ReasonCode>ProcessingFailure</ReasonCode>
                <ReasonDescription>Amazon could not process the transaction due to an internal processing error. You should only retry the capture if the authorization is in the Open state. Otherwise, you should request a new authorization and then call Capture on it.</ReasonDescription>
            </CaptureStatus>
            <CreationTimestamp>2012-11-03T19:10:16Z</CreationTimestamp>
        </CaptureDetails>
    </CaptureResult>
    <ResponseMetadata>
        <RequestId>b4ab4bc3-c9ea-44f0-9a3d-67cccef565c6</RequestId>
    </ResponseMetadata>
</CaptureResponse>